/**
 * 具体的菜谱信息
 */

import { SPACE_RGE } from '@/common/common.js';

// workTime temperature stirSwitch preheatSwitch
// 4 3 11
class Recipes {
    constructor ( arr, id ) {
        this.name = arr[ 0 ];
        this.workTime = +arr[ 4 ];
        this.temperature = +arr[ 3 ];
        this.stirSwitch = !!+arr[ 11 ];
        this.preheatSwitch = true;
        this.id = id;

        this.yrte = arr[ 1 ];       // 预热温度
        this.yrti = arr[ 2 ];       // 预热时间
        this.minte = arr[ 5 ];      // 最小可调温度
        this.maxte = arr[ 6 ];      // 最大可调温度
        this.stepte = arr[ 7 ];     // 温度可调步长
        this.minti = arr[ 8 ];      // 最小可调时间(分)
        this.maxti = arr[ 9 ];      // 最大可调时间(分)
        this.stepti = arr[ 10 ];     // 时间可调步长
    }
}

let data = [
    'DIY 160 5 160 10 80 200 5 1 60 1 0',
    '浓情烤翅 200 5 200 25 80 200 5 1 60 1 0',
    '黄金薯条 200 5 200 17 80 200 5 1 60 1 0',
    '葡式蛋挞 200 5 200 20 80 200 5 1 60 1 0',
    '香烤板栗 200 5 200 15 80 200 5 1 60 1 0',
    '酱香排骨 200 5 200 25 80 200 5 1 60 1 0',
    '黄金煎饺 200 5 200 15 80 200 5 1 60 1 0',
    '童趣鸡米花 200 5 200 20 80 200 5 1 60 1 0',
    '盐烤带鱼 180 5 180 20 80 200 5 1 60 1 0',
    '蒜香大虾 200 5 200 10 80 200 5 1 60 1 0',
    '拧香秋刀鱼 180 5 180 15 80 200 5 1 60 1 0',
    '辣烤鱿鱼 180 5 180 15 80 200 5 1 60 1 0',
    '美味牛排 180 5 180 10 80 200 5 1 60 1 0',
    '孜然羊排 180 5 180 25 80 200 5 1 60 1 0',
    '香煎五花肉 180 5 180 13 80 200 5 1 60 1 0',
    '彩蔬串串 180 5 180 15 80 200 5 1 60 1 0',
    '香烤紫薯 190 5 190 30 80 200 5 1 60 1 0',
    '田园玉米 190 5 190 25 80 200 5 1 60 1 0',
    '椒盐娃娃菜 180 5 180 10 80 200 5 1 60 1 0',
    '黄金炸豆腐 200 5 200 13 80 200 5 1 60 1 0',
    '香炸花生米 180 5 180 12 80 200 5 1 60 1 0',
    '劲爆爆米花 200 5 200 10 80 200 5 1 60 1 0',
    '脆香腰果 180 5 180 10 80 200 5 1 60 1 0',
    '纸杯蛋糕 170 5 170 25 80 200 5 1 60 1 0',
    '奶香小餐包 160 5 160 20 80 200 5 1 60 1 0',
    '黄金馒头片 200 5 200 13 80 200 5 1 60 1 0',
    '黄油曲奇 170 5 170 20 80 200 5 1 60 1 0',
    '宝贝磨牙棒 160 5 160 24 80 200 5 1 60 1 0',
    '麦香油条 200 5 200 7 80 200 5 1 60 1 0',
    '黄金煎包 180 5 180 15 80 200 5 1 60 1 0',
    '飘香手抓饼 175 5 175 10 80 200 5 1 60 1 0',
    '香炸春卷 200 5 200 12 80 200 5 1 60 1 0'
];

export default data.map( ( el, index ) => new Recipes( el.split( SPACE_RGE ), index ) );
